OpenFOAM-pimpleFoam-RAS-3D-Wing-main/OpenFOAM-pimpleFoam-RAS-3D-Wing-main/airfoil_rotating/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    "(p|pcorr)"
    {
        solver          GAMG;
        smoother        DICGaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
    }
    "(p|pcorr)Final"
    {
        $p;
        tolerance       1e-08;
        relTol          0;
    }
    "(U|k|omega)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-08;
        relTol          0.1;
    }
    "(U|k|omega)Final"
    {
        $U;
        tolerance       1e-08;
        relTol          0;
    }
}


PIMPLE
{
    momentumPredictor   yes;
    nOuterCorrectors    4;
    nCorrectors     4;
    nNonOrthogonalCorrectors 4;
}

// ************************************************************************* //
